In [217]:
import numpy as np
import pandas as pd

In [229]:
tz_data = np.array([["M0001",-8],
["M0003",-8],
["M0005",-3],
["M0008",-6],
["M0009",-9],
["M0013",-5],
["M0014",-5],
["M0017",-6],
["M0019",-9],
["M0021",-3],
["M0033",-2],
["M0034",-9],
["M0038",-3]])

In [230]:
df_tz_data = pd.DataFrame(tz_data)
df_tz_data.head()

       0   1
0  M0001  -8
1  M0003  -8
2  M0005  -3
3  M0008  -6
4  M0009  -9

In [231]:
string = """C059993,M0033,6-Jan-16,5:56:10 AM,206
C059993,M0034,2-May-16,10:59:02 PM,381
C059994,M0001,13-Mar-16,11:28:08 PM,303
C059994,M0008,10-May-16,1:30:35 AM,685
C059994,M0021,14-Dec-16,4:48:08 AM,146
C059996,M0038,5-Sep-16,4:58:47 AM,129
C059997,M0005,18-Jan-16,4:39:59 AM,255
C059997,M0013,14-Feb-16,2:45:57 AM,276
C059998,M0019,18-Dec-16,10:45:24 PM,106
C059999,M0014,20-Mar-16,2:50:07 AM,440
C060000,M0009,19-May-16,10:37:37 PM,49
C060000,M0017,19-Dec-16,1:43:46 AM,219"""

a = np.array(string.split("\n"))
a.shape

(12L,)

In [232]:
transaction_data = []
for s in a:
    li = s.split(",")
    transaction_data.append(li)
transaction_data = np.array(transaction_data)
transaction_data

array([['C059993', 'M0033', '6-Jan-16', '5:56:10 AM', '206'],
       ['C059993', 'M0034', '2-May-16', '10:59:02 PM', '381'],
       ['C059994', 'M0001', '13-Mar-16', '11:28:08 PM', '303'],
       ['C059994', 'M0008', '10-May-16', '1:30:35 AM', '685'],
       ['C059994', 'M0021', '14-Dec-16', '4:48:08 AM', '146'],
       ['C059996', 'M0038', '5-Sep-16', '4:58:47 AM', '129'],
       ['C059997', 'M0005', '18-Jan-16', '4:39:59 AM', '255'],
       ['C059997', 'M0013', '14-Feb-16', '2:45:57 AM', '276'],
       ['C059998', 'M0019', '18-Dec-16', '10:45:24 PM', '106'],
       ['C059999', 'M0014', '20-Mar-16', '2:50:07 AM', '440'],
       ['C060000', 'M0009', '19-May-16', '10:37:37 PM', '49'],
       ['C060000', 'M0017', '19-Dec-16', '1:43:46 AM', '219']],
      dtype='|S11')

In [233]:
df_trans_data = pd.DataFrame(transaction_data)
df_trans_data.head()

         0      1          2            3    4
0  C059993  M0033   6-Jan-16   5:56:10 AM  206
1  C059993  M0034   2-May-16  10:59:02 PM  381
2  C059994  M0001  13-Mar-16  11:28:08 PM  303
3  C059994  M0008  10-May-16   1:30:35 AM  685
4  C059994  M0021  14-Dec-16   4:48:08 AM  146

In [234]:
df_tz_data.columns = ["Rest_id", "GMT_diff"]
df_trans_data.columns = ["Cust_id", "Rest_id", "Date", "Time", "Amount"]

In [235]:
string = """C059993,M0014,7-Jun-16,7:47:00 AM,166,N
C059993,M0033,6-Jan-16,7:56:10 AM,161,Y
C059993,M0034,3-May-16,7:59:02 AM,280,Y
C059994,M0001,14-Mar-16,7:28:08 AM,236,Y
C059994,M0008,10-May-16,7:30:35 AM,526,Y
C059994,M0021,14-Dec-16,7:48:08 AM,118,Y
C059996,M0038,5-Sep-16,7:58:47 AM,109,Y
C059997,M0005,18-Jan-16,7:39:59 AM,243,Y
C059997,M0013,14-Feb-16,7:45:57 AM,200,Y
C059998,M0003,13-Mar-16,7:28:35 AM,1330,N
C059998,M0019,19-Dec-16,7:45:24 AM,89,Y
C059999,M0014,20-Mar-16,7:50:07 AM,325,Y
C060000,M0009,20-May-16,7:37:37 AM,45,Y
C060000,M0017,19-Dec-16,7:43:46 AM,184,Y"""

a = np.array(string.split("\n"))
a.shape

(14L,)

In [236]:
tip_data = []
for s in a:
    li = s.split(",")
    tip_data.append(li)
tip_data = np.array(tip_data)
tip_data

array([['C059993', 'M0014', '7-Jun-16', '7:47:00 AM', '166', 'N'],
       ['C059993', 'M0033', '6-Jan-16', '7:56:10 AM', '161', 'Y'],
       ['C059993', 'M0034', '3-May-16', '7:59:02 AM', '280', 'Y'],
       ['C059994', 'M0001', '14-Mar-16', '7:28:08 AM', '236', 'Y'],
       ['C059994', 'M0008', '10-May-16', '7:30:35 AM', '526', 'Y'],
       ['C059994', 'M0021', '14-Dec-16', '7:48:08 AM', '118', 'Y'],
       ['C059996', 'M0038', '5-Sep-16', '7:58:47 AM', '109', 'Y'],
       ['C059997', 'M0005', '18-Jan-16', '7:39:59 AM', '243', 'Y'],
       ['C059997', 'M0013', '14-Feb-16', '7:45:57 AM', '200', 'Y'],
       ['C059998', 'M0003', '13-Mar-16', '7:28:35 AM', '1330', 'N'],
       ['C059998', 'M0019', '19-Dec-16', '7:45:24 AM', '89', 'Y'],
       ['C059999', 'M0014', '20-Mar-16', '7:50:07 AM', '325', 'Y'],
       ['C060000', 'M0009', '20-May-16', '7:37:37 AM', '45', 'Y'],
       ['C060000', 'M0017', '19-Dec-16', '7:43:46 AM', '184', 'Y']],
      dtype='|S10')

In [237]:
df_tip_data = pd.DataFrame(tip_data)
df_tip_data.columns = ["Cust_id", "Rest_id", "Date", "Time", "Amount_no_tip", "Approved"]
df_tip_data["Amount_no_tip"] = df_tip_data["Amount_no_tip"].astype(int)
df_tip_data.head()

   Cust_id Rest_id       Date        Time  Amount_no_tip Approved
0  C059993   M0014   7-Jun-16  7:47:00 AM            166        N
1  C059993   M0033   6-Jan-16  7:56:10 AM            161        Y
2  C059993   M0034   3-May-16  7:59:02 AM            280        Y
3  C059994   M0001  14-Mar-16  7:28:08 AM            236        Y
4  C059994   M0008  10-May-16  7:30:35 AM            526        Y

In [238]:
trans_count = df_trans_data.groupby(df_trans_data.Cust_id).count()["Rest_id"]
trans_count

Cust_id
C059993    2
C059994    3
C059996    1
C059997    2
C059998    1
C059999    1
C060000    2
Name: Rest_id, dtype: int64

In [239]:
df1 = pd.merge(df_tz_data, df_trans_data, on = "Rest_id")
df1

   Rest_id GMT_diff  Cust_id       Date         Time Amount
0    M0001       -8  C059994  13-Mar-16  11:28:08 PM    303
1    M0005       -3  C059997  18-Jan-16   4:39:59 AM    255
2    M0008       -6  C059994  10-May-16   1:30:35 AM    685
3    M0009       -9  C060000  19-May-16  10:37:37 PM     49
4    M0013       -5  C059997  14-Feb-16   2:45:57 AM    276
5    M0014       -5  C059999  20-Mar-16   2:50:07 AM    440
6    M0017       -6  C060000  19-Dec-16   1:43:46 AM    219
7    M0019       -9  C059998  18-Dec-16  10:45:24 PM    106
8    M0021       -3  C059994  14-Dec-16   4:48:08 AM    146
9    M0033       -2  C059993   6-Jan-16   5:56:10 AM    206
10   M0034       -9  C059993   2-May-16  10:59:02 PM    381
11   M0038       -3  C059996   5-Sep-16   4:58:47 AM    129

In [240]:
def change_time(date, time, gmt):
    type = time.split()[1]
    t = time.split()[0]
    hrs = t.split(":")[0]
    gmt_hrs = int(hrs) - int(gmt)
    d = date.split("-")[0]
    new_date = date
    if (gmt_hrs > 12):
        if type == "AM":
            type = "PM"
        else:
            new_date = str(int(d)+1) + "-" + date.split("-")[1] + "-" + date.split("-")[2]
            type = "AM" 
    
    if gmt_hrs < 0:
        if type == "AM":
            new_date = str(int(d)-1) + "-" + date.split("-")[1] + "-" + date.split("-")[2]
            type = "PM"
        else:
            type = "AM"
            
        new_t = str(12 + gmt_hrs) + ":" + t.split(":")[1] + ":" + t.split(":")[2] + " " + type
    
    new_t = str(gmt_hrs%12) + ":" + t.split(":")[1] + ":" + t.split(":")[2] + " " + type
    
    return [new_t,new_date]

In [241]:
change_time("13-Mar-16", "2:28:08 AM", "3" )

['11:28:08 PM', '12-Mar-16']

In [242]:
new_time = []
new_date = []
for i in range(df1.shape[0]):
    new_time.append(change_time(df1.iloc[i,:].Date, df1.iloc[i,:].Time, df1.iloc[i,:].GMT_diff)[0])
    new_date.append(change_time(df1.iloc[i,:].Date, df1.iloc[i,:].Time, df1.iloc[i,:].GMT_diff)[1])

In [243]:
df1["Time"] = pd.Series(new_time)
df1["Date"] = pd.Series(new_date)
df1.head()

  Rest_id GMT_diff  Cust_id       Date        Time Amount
0   M0001       -8  C059994  14-Mar-16  7:28:08 AM    303
1   M0005       -3  C059997  18-Jan-16  7:39:59 AM    255
2   M0008       -6  C059994  10-May-16  7:30:35 AM    685
3   M0009       -9  C060000  20-May-16  7:37:37 AM     49
4   M0013       -5  C059997  14-Feb-16  7:45:57 AM    276

In [244]:
df_tip_data

    Cust_id Rest_id       Date        Time  Amount_no_tip Approved
0   C059993   M0014   7-Jun-16  7:47:00 AM            166        N
1   C059993   M0033   6-Jan-16  7:56:10 AM            161        Y
2   C059993   M0034   3-May-16  7:59:02 AM            280        Y
3   C059994   M0001  14-Mar-16  7:28:08 AM            236        Y
4   C059994   M0008  10-May-16  7:30:35 AM            526        Y
5   C059994   M0021  14-Dec-16  7:48:08 AM            118        Y
6   C059996   M0038   5-Sep-16  7:58:47 AM            109        Y
7   C059997   M0005  18-Jan-16  7:39:59 AM            243        Y
8   C059997   M0013  14-Feb-16  7:45:57 AM            200        Y
9   C059998   M0003  13-Mar-16  7:28:35 AM           1330        N
10  C059998   M0019  19-Dec-16  7:45:24 AM             89        Y
11  C059999   M0014  20-Mar-16  7:50:07 AM            325        Y
12  C060000   M0009  20-May-16  7:37:37 AM             45        Y
13  C060000   M0017  19-Dec-16  7:43:46 AM            184        Y

In [245]:
df_tip_data

    Cust_id Rest_id       Date        Time  Amount_no_tip Approved
0   C059993   M0014   7-Jun-16  7:47:00 AM            166        N
1   C059993   M0033   6-Jan-16  7:56:10 AM            161        Y
2   C059993   M0034   3-May-16  7:59:02 AM            280        Y
3   C059994   M0001  14-Mar-16  7:28:08 AM            236        Y
4   C059994   M0008  10-May-16  7:30:35 AM            526        Y
5   C059994   M0021  14-Dec-16  7:48:08 AM            118        Y
6   C059996   M0038   5-Sep-16  7:58:47 AM            109        Y
7   C059997   M0005  18-Jan-16  7:39:59 AM            243        Y
8   C059997   M0013  14-Feb-16  7:45:57 AM            200        Y
9   C059998   M0003  13-Mar-16  7:28:35 AM           1330        N
10  C059998   M0019  19-Dec-16  7:45:24 AM             89        Y
11  C059999   M0014  20-Mar-16  7:50:07 AM            325        Y
12  C060000   M0009  20-May-16  7:37:37 AM             45        Y
13  C060000   M0017  19-Dec-16  7:43:46 AM            184        Y

In [246]:
df2 = pd.merge(df1, df_tip_data, on = ["Rest_id","Time","Cust_id","Date"])
df2

,Rest_id,GMT_diff,Cust_id,Date,Time,Amount,Amount_no_tip,Approved
0,M0001,-8,C059994,14-Mar-16,7:28:08 AM,303,236,Y
1,M0005,-3,C059997,18-Jan-16,7:39:59 AM,255,243,Y
2,M0008,-6,C059994,10-May-16,7:30:35 AM,685,526,Y
3,M0009,-9,C060000,20-May-16,7:37:37 AM,49,45,Y
4,M0013,-5,C059997,14-Feb-16,7:45:57 AM,276,200,Y
5,M0014,-5,C059999,20-Mar-16,7:50:07 AM,440,325,Y
6,M0017,-6,C060000,19-Dec-16,7:43:46 AM,219,184,Y
7,M0019,-9,C059998,19-Dec-16,7:45:24 AM,106,89,Y
8,M0021,-3,C059994,14-Dec-16,7:48:08 AM,146,118,Y
9,M0033,-2,C059993,6-Jan-16,7:56:10 AM,206,161,Y
10,M0034,-9,C059993,3-May-16,7:59:02 AM,381,280,Y
11,M0038,-3,C059996,5-Sep-16,7:58:47 AM,129,109,Y

In [247]:
def find_tip_perc(amount, no_tip_amount):
    tip = amount - no_tip_amount
    tip_perc = float(tip)/float(no_tip_amount)
    return tip_perc

In [248]:
tip_perc = []
for i in range(df2.shape[0]):
    tip_perc.append(find_tip_perc(int(df2["Amount"].iloc[i]), int(df2["Amount_no_tip"].iloc[i])))

In [249]:
df2["Tip_perc"] = pd.Series(tip_perc)
df2.head()

,Rest_id,GMT_diff,Cust_id,Date,Time,Amount,Amount_no_tip,Approved,Tip_perc
0,M0001,-8,C059994,14-Mar-16,7:28:08 AM,303,236,Y,0.283898
1,M0005,-3,C059997,18-Jan-16,7:39:59 AM,255,243,Y,0.049383
2,M0008,-6,C059994,10-May-16,7:30:35 AM,685,526,Y,0.302281
3,M0009,-9,C060000,20-May-16,7:37:37 AM,49,45,Y,0.088889
4,M0013,-5,C059997,14-Feb-16,7:45:57 AM,276,200,Y,0.380000

In [250]:
df2

,Rest_id,GMT_diff,Cust_id,Date,Time,Amount,Amount_no_tip,Approved,Tip_perc
0,M0001,-8,C059994,14-Mar-16,7:28:08 AM,303,236,Y,0.283898
1,M0005,-3,C059997,18-Jan-16,7:39:59 AM,255,243,Y,0.049383
2,M0008,-6,C059994,10-May-16,7:30:35 AM,685,526,Y,0.302281
3,M0009,-9,C060000,20-May-16,7:37:37 AM,49,45,Y,0.088889
4,M0013,-5,C059997,14-Feb-16,7:45:57 AM,276,200,Y,0.380000
5,M0014,-5,C059999,20-Mar-16,7:50:07 AM,440,325,Y,0.353846
6,M0017,-6,C060000,19-Dec-16,7:43:46 AM,219,184,Y,0.190217
7,M0019,-9,C059998,19-Dec-16,7:45:24 AM,106,89,Y,0.191011
8,M0021,-3,C059994,14-Dec-16,7:48:08 AM,146,118,Y,0.237288
9,M0033,-2,C059993,6-Jan-16,7:56:10 AM,206,161,Y,0.279503
10,M0034,-9,C059993,3-May-16,7:59:02 AM,381,280,Y,0.360714
11,M0038,-3,C059996,5-Sep-16,7:58:47 AM,129,109,Y,0.183486

In [252]:
amount_excluding_tip = df2.groupby(df2.Cust_id)["Amount_no_tip"].sum()
amount_excluding_tip

Cust_id
C059993    441
C059994    880
C059996    109
C059997    443
C059998     89
C059999    325
C060000    229
Name: Amount_no_tip, dtype: int32

In [253]:
grouped_data =  df2.groupby(df2["Cust_id"])["Tip_perc"]
tip_perc = grouped_data.mean()
tip_perc

Cust_id
C059993    0.320109
C059994    0.274489
C059996    0.183486
C059997    0.214691
C059998    0.191011
C059999    0.353846
C060000    0.139553
Name: Tip_perc, dtype: float64

In [254]:
df_final = pd.DataFrame((tip_perc >= 0.2) & (trans_count >=2) & (amount_excluding_tip >=300))
df_final = df_final.reset_index()

In [255]:
tip_perc

Cust_id
C059993    0.320109
C059994    0.274489
C059996    0.183486
C059997    0.214691
C059998    0.191011
C059999    0.353846
C060000    0.139553
Name: Tip_perc, dtype: float64

In [256]:
for i in range(df_final.shape[0]):
    if int(df_final.iloc[i,1]) == 1 :
        text = "Y"
    else:
        text = "N"
        
    print df_final["Cust_id"].iloc[i] + " " + text

C059993 Y
C059994 Y
C059996 N
C059997 Y
C059998 N
C059999 N
C060000 N

In [257]:
df_final

   Cust_id      0
0  C059993   True
1  C059994   True
2  C059996  False
3  C059997   True
4  C059998  False
5  C059999  False
6  C060000  False

In [258]:
trans_count

Cust_id
C059993    2
C059994    3
C059996    1
C059997    2
C059998    1
C059999    1
C060000    2
Name: Rest_id, dtype: int64

In [259]:
amount_excluding_tip

Cust_id
C059993    441
C059994    880
C059996    109
C059997    443
C059998     89
C059999    325
C060000    229
Name: Amount_no_tip, dtype: int32